Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateStringers Property
 Can't create stringers geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateStringers { get; }
Public Shared ReadOnly Property CannotCreateStringers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateStringers {
	FailureDefinitionId^ get ();
}
static member CannotCreateStringers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace